proceedings/app/controllers/proceedings_controller.rb

  def index
    @proceedings = Proceeding.all
---
SELECT * FROM `proceedings`

  def show
    @proceeding = Proceeding.find(params[:id])
---
SELECT * FROM `proceedings` WHERE (`proceedings`.`id` = 1)

  def edit
    @proceeding = Proceeding.find(params[:id])
---
SELECT * FROM `proceedings` WHERE (`proceedings`.`id` = 1)

  def create
    @proceeding = Proceeding.new(params[:proceeding])

    respond_to do |format|
      if @proceeding.save
---
INSERT INTO `proceedings` (`journal_short_name`, `journal_name`, `updated_at`, `title`, `type`, `used_pages`, `year`, `issue`, `authors`, `volume`, `keywords`, `created_at`) VALUES('', '', '2010-08-27 09:30:56', 'test', NULL, '', '', '', 'kllk', '', '', '2010-08-27 09:30:56')

  def update
    @proceeding = Proceeding.find(params[:id])

    respond_to do |format|
      if @proceeding.update_attributes(params[:proceeding])
---
SELECT * FROM `proceedings` WHERE (`proceedings`.`id` = 1)
UPDATE `proceedings` SET `journal_name` = '22', `updated_at` = '2010-08-27 15:55:12' WHERE `id` = 1

  def destroy
    @proceeding = Proceeding.find(params[:id])
    @proceeding.destroy
---
SELECT * FROM `proceedings` WHERE (`proceedings`.`id` = 1)
DELETE FROM `proceedings` WHERE `id` = 1